//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x5f23ee=_0x1e02;function _0x3c6c(){const _0x3d1db4=['18HWtjdy','3235730uuOTTo','0\x20(Linux;\x20',';\x20K)\x20Apple',',\x20like\x20Gec','39917SeWUmO','PaOgr','14842720jDQEgV','getHeaders','.ai/','axios','enhanceIma','message','.ai','2943882stjgIN','3ZzQcNJ','/124.0.0.0','e/upscale/','\x20Mobile\x20Sa','https://ap','Mozilla/5.','form-data','3858944caJziA','https://ww','xsGfC','ko)\x20Chrome','append','HxvFH','OPMqJ','WebKit/537','PJZGn','6893208zIoxtu','CzUfX','arraybuffe','w.pixelcut','error','Android\x2010','i2.pixelcu','post','22SwexmI','zNXKP','@PikaBotz','image','japEi','fari/537.3','3324308ZEmHNV','t.app/imag','scale','.36\x20(KHTML','data'];_0x3c6c=function(){return _0x3d1db4;};return _0x3c6c();}(function(_0x531046,_0x34b8cc){const _0x12c07d=_0x1e02,_0x59bf42=_0x531046();while(!![]){try{const _0x5c9954=-parseInt(_0x12c07d(0x18d))/(0x36*-0x40+0x21f5+0x1dc*-0xb)*(-parseInt(_0x12c07d(0x17d))/(-0x1e02+-0x21f9+0x3ffd))+parseInt(_0x12c07d(0x165))/(0xf4e+0x96*-0x37+0x5a5*0x3)*(parseInt(_0x12c07d(0x183))/(0x12b6+-0x3e3+-0xecf))+-parseInt(_0x12c07d(0x189))/(0xd*0x39+-0xffe*0x1+0xd1e)+parseInt(_0x12c07d(0x164))/(-0x99b*0x1+-0x1359+-0x2*-0xe7d)+-parseInt(_0x12c07d(0x175))/(0x1*0xb67+-0x2e*-0x79+-0x1*0x211e)+-parseInt(_0x12c07d(0x16c))/(0xa62+0xb86+-0x15e0)*(parseInt(_0x12c07d(0x188))/(0x425*-0x1+-0x1cbd*-0x1+-0x188f))+parseInt(_0x12c07d(0x18f))/(-0x61*0x19+-0x3*-0xae5+0x1*-0x172c);if(_0x5c9954===_0x34b8cc)break;else _0x59bf42['push'](_0x59bf42['shift']());}catch(_0xa3b5c8){_0x59bf42['push'](_0x59bf42['shift']());}}}(_0x3c6c,-0x1277*0x89+0x5*-0x40da+-0x2da7*-0x76));const axios=require(_0x5f23ee(0x160)),FormData=require(_0x5f23ee(0x16b));function _0x1e02(_0x48f42f,_0x2d286a){const _0x73827d=_0x3c6c();return _0x1e02=function(_0x235e49,_0x114b9a){_0x235e49=_0x235e49-(-0x4*0x829+-0x1403+-0x1*-0x3605);let _0xef60c3=_0x73827d[_0x235e49];return _0xef60c3;},_0x1e02(_0x48f42f,_0x2d286a);}exports[_0x5f23ee(0x161)+'ge']=async _0x3f2652=>{const _0x1bd62d=_0x5f23ee,_0x5e7f1f={'CzUfX':_0x1bd62d(0x180),'HxvFH':_0x1bd62d(0x185),'OPMqJ':_0x1bd62d(0x169)+_0x1bd62d(0x17b)+_0x1bd62d(0x184)+_0x1bd62d(0x167)+'v1','PaOgr':_0x1bd62d(0x16a)+_0x1bd62d(0x18a)+_0x1bd62d(0x17a)+_0x1bd62d(0x18b)+_0x1bd62d(0x173)+_0x1bd62d(0x186)+_0x1bd62d(0x18c)+_0x1bd62d(0x16f)+_0x1bd62d(0x166)+_0x1bd62d(0x168)+_0x1bd62d(0x182)+'6','zNXKP':_0x1bd62d(0x16d)+_0x1bd62d(0x178)+_0x1bd62d(0x163),'japEi':_0x1bd62d(0x16d)+_0x1bd62d(0x178)+_0x1bd62d(0x15f),'xsGfC':_0x1bd62d(0x177)+'r','PJZGn':_0x1bd62d(0x17f)},_0x5cbf26=new FormData();_0x5cbf26[_0x1bd62d(0x170)](_0x5e7f1f[_0x1bd62d(0x176)],_0x3f2652),_0x5cbf26[_0x1bd62d(0x170)](_0x5e7f1f[_0x1bd62d(0x171)],'2');try{const _0x21cfb3=await axios[_0x1bd62d(0x17c)](_0x5e7f1f[_0x1bd62d(0x172)],_0x5cbf26,{'headers':{..._0x5cbf26[_0x1bd62d(0x15e)](),'Authorization':'','User-Agent':_0x5e7f1f[_0x1bd62d(0x18e)],'Origin':_0x5e7f1f[_0x1bd62d(0x17e)],'Referer':_0x5e7f1f[_0x1bd62d(0x181)]},'responseType':_0x5e7f1f[_0x1bd62d(0x16e)]});return{'status':!![],'code':0xc8,'creator':_0x5e7f1f[_0x1bd62d(0x174)],'image':_0x21cfb3[_0x1bd62d(0x187)]};}catch(_0x46dcc1){return console[_0x1bd62d(0x179)](_0x46dcc1),{'status':![],'code':0x1f4,'creator':_0x5e7f1f[_0x1bd62d(0x174)],'message':_0x46dcc1[_0x1bd62d(0x162)]};}};
