//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


function _0x1be8(){const _0x5dd61b=['eUymY','data','213158LyjEWZ','dIgPM','8GsbhLm','yes','i.koyeb.ap','\x20\x27id\x27.','430zkTgnG','quired\x20par','response','status','19392QdQVuV','12LcwiEC','968530YxPOuU','Missing\x20re','message','797268JjfmnC','exports','cIEjc','wnWSx','uMOjH','56IIzovL','@PikaBotz','1503901AyQMUk','357490RFdYVJ','ameters:\x20\x27','toString','prompt\x27\x20or','get','3430917wmCpOx','https://ca','Ggqun','axios'];_0x1be8=function(){return _0x5dd61b;};return _0x1be8();}const _0x2d0b8c=_0x4c19;(function(_0x11b6e8,_0x2de8f0){const _0x8207f2=_0x4c19,_0x2dcd7f=_0x11b6e8();while(!![]){try{const _0x122077=-parseInt(_0x8207f2(0x11b))/(-0x417+-0x1171+0x1589)+-parseInt(_0x8207f2(0x113))/(0x16da+-0xdbd+-0x91b*0x1)+-parseInt(_0x8207f2(0x130))/(0x20b*-0x9+0x1*0x1129+0x1*0x13d)*(parseInt(_0x8207f2(0x118))/(0xa*-0x255+-0x76*0x1f+0x25a0))+parseInt(_0x8207f2(0x110))/(0x1768+0x17f7+0x1*-0x2f5a)*(parseInt(_0x8207f2(0x10f))/(0xa9*-0x29+0x199*0x3+0x593*0x4))+-parseInt(_0x8207f2(0x11a))/(-0x7*0x2f3+-0x6f7+0x1*0x1ba3)*(-parseInt(_0x8207f2(0x128))/(-0x14e*0x1+-0x176e+0x18c4))+-parseInt(_0x8207f2(0x120))/(-0x198c+-0x8b*0xe+0x212f)+parseInt(_0x8207f2(0x12c))/(-0x382+-0x829*-0x1+-0x49d)*(parseInt(_0x8207f2(0x126))/(-0x9d1+0x892+0x1*0x14a));if(_0x122077===_0x2de8f0)break;else _0x2dcd7f['push'](_0x2dcd7f['shift']());}catch(_0x33c00a){_0x2dcd7f['push'](_0x2dcd7f['shift']());}}}(_0x1be8,-0x39369*0x1+-0x1734f*0x1+0x1*0x831f4));function _0x4c19(_0x2c3088,_0xf9df99){const _0x2172a0=_0x1be8();return _0x4c19=function(_0x508e23,_0x1fa59c){_0x508e23=_0x508e23-(-0x15d+-0xc5b+0x4ed*0x3);let _0x5e2343=_0x2172a0[_0x508e23];return _0x5e2343;},_0x4c19(_0x2c3088,_0xf9df99);}const axios=require(_0x2d0b8c(0x123)),baseUrl=_0x2d0b8c(0x121)+_0x2d0b8c(0x12a)+'p',cai=async(_0x113107,_0x4ed322,_0x2327a9=null,_0x422233=![])=>{const _0x4a811b=_0x2d0b8c,_0x1e56a8={'dIgPM':function(_0x1c4f0c,_0x5d5cab){return _0x1c4f0c||_0x5d5cab;},'Ggqun':_0x4a811b(0x119),'eUymY':_0x4a811b(0x111)+_0x4a811b(0x12d)+_0x4a811b(0x11c)+_0x4a811b(0x11e)+_0x4a811b(0x12b),'cIEjc':function(_0x5a903f,_0x4b7bf4){return _0x5a903f(_0x4b7bf4);},'wnWSx':function(_0xde5ccb,_0x34fe55){return _0xde5ccb&&_0x34fe55;},'uMOjH':_0x4a811b(0x129)};if(_0x1e56a8[_0x4a811b(0x127)](!_0x113107,!_0x4ed322))return{'status':![],'code':0x194,'creator':_0x1e56a8[_0x4a811b(0x122)],'message':_0x1e56a8[_0x4a811b(0x124)]};try{const _0xad9a08={'prompt':_0x1e56a8[_0x4a811b(0x115)](encodeURIComponent,_0x113107),'id':_0x4ed322,..._0x1e56a8[_0x4a811b(0x116)](_0x2327a9,{'image':_0x2327a9}),..._0x1e56a8[_0x4a811b(0x116)](_0x422233,{'voice':_0x1e56a8[_0x4a811b(0x117)]})},_0xbcd2df=new URLSearchParams(_0xad9a08)[_0x4a811b(0x11d)](),_0x33d58f=await axios[_0x4a811b(0x11f)](baseUrl+'?'+_0xbcd2df);return _0x33d58f[_0x4a811b(0x125)];}catch(_0xf96700){return{'status':![],'creator':_0x1e56a8[_0x4a811b(0x122)],'message':_0xf96700[_0x4a811b(0x12e)]?.[_0x4a811b(0x125)]?.[_0x4a811b(0x112)]||_0xf96700[_0x4a811b(0x112)],'code':_0xf96700[_0x4a811b(0x12e)]?.[_0x4a811b(0x12f)]||0x1575+0xd3a+0x93*-0x39};}};module[_0x2d0b8c(0x114)]={'cai':cai};
