//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x36f708=_0x1e8e;(function(_0x304314,_0x309041){const _0x3c9076=_0x1e8e,_0x32e439=_0x304314();while(!![]){try{const _0x4142b5=-parseInt(_0x3c9076(0x9b))/(0x269a+0xc83*-0x1+-0x1a16)*(-parseInt(_0x3c9076(0xa0))/(0xc7*-0x17+-0x1536+0x1*0x2719))+parseInt(_0x3c9076(0xa4))/(-0x14d5+-0x1*-0x79f+-0x2a5*-0x5)*(parseInt(_0x3c9076(0x9f))/(0xd*-0x110+-0x23b3+0x3187))+-parseInt(_0x3c9076(0xad))/(-0x1*0xf2a+-0x1bdb+0x626*0x7)+-parseInt(_0x3c9076(0x90))/(-0x1df*0x2+0x3ea*0x6+0x8*-0x277)*(parseInt(_0x3c9076(0x98))/(0xe8c+0xec1*0x1+-0x1d46))+parseInt(_0x3c9076(0xab))/(0x7*0x281+0x2*0xcf7+-0x2b6d)*(parseInt(_0x3c9076(0xaf))/(-0x94d*-0x1+-0xab5*-0x1+-0x13f9*0x1))+parseInt(_0x3c9076(0x97))/(-0x1c1+-0x1*0x18c8+-0x1*-0x1a93)*(parseInt(_0x3c9076(0x99))/(0x147a*0x1+0x187e+0x2ced*-0x1))+-parseInt(_0x3c9076(0xa9))/(0x4*0x74d+0x1e0f+-0x3b37);if(_0x4142b5===_0x309041)break;else _0x32e439['push'](_0x32e439['shift']());}catch(_0x3e77c4){_0x32e439['push'](_0x32e439['shift']());}}}(_0xfbe3,-0xc4bdd+-0x1*0x9c193+0x209ccc));function _0x1e8e(_0x16d74f,_0x112667){const _0x10e4d9=_0xfbe3();return _0x1e8e=function(_0x332226,_0x4fa0fd){_0x332226=_0x332226-(-0x11c+0x1dbb+-0x1c18);let _0x16630f=_0x10e4d9[_0x332226];return _0x16630f;},_0x1e8e(_0x16d74f,_0x112667);}const axios=require(_0x36f708(0x8e));function getRandomSeed(){const _0x4892c9=_0x36f708,_0xe2728c={'pDKpA':function(_0x2e9fbf,_0xc18b71){return _0x2e9fbf+_0xc18b71;},'wPGcX':function(_0x32a2cf,_0xbadaf0){return _0x32a2cf*_0xbadaf0;}};return _0xe2728c[_0x4892c9(0x8f)](Math[_0x4892c9(0x9a)](_0xe2728c[_0x4892c9(0xa6)](Math[_0x4892c9(0xae)](),-0x2321+-0x2*0x82e+0x33a7)),0x573+0x107b*-0x1+-0x71*-0x19);}async function pollinationsAi(_0x4c2443){const _0x4268a2=_0x36f708,_0x1a785f={'IdXbY':_0x4268a2(0x9e),'BeABU':_0x4268a2(0x87)+_0x4268a2(0xa3),'SAtVW':function(_0x21a4b5){return _0x21a4b5();},'FMpkZ':function(_0x45a856,_0xc395d5){return _0x45a856(_0xc395d5);},'CxDjI':_0x4268a2(0x9c)+'r','FINJa':_0x4268a2(0xb1)+_0x4268a2(0x8b)+_0x4268a2(0xa2)};if(!_0x4c2443)return{'status':![],'code':0x190,'creator':_0x1a785f[_0x4268a2(0x95)],'message':_0x1a785f[_0x4268a2(0x8a)]};try{const _0x1be795=_0x1a785f[_0x4268a2(0xb0)](getRandomSeed),{data:_0x102587}=await axios[_0x4268a2(0xa8)](_0x4268a2(0x89)+_0x4268a2(0x94)+_0x4268a2(0xa5)+_0x4268a2(0x8c)+_0x1a785f[_0x4268a2(0xaa)](encodeURIComponent,_0x4c2443)+(_0x4268a2(0x96)+_0x4268a2(0x8d)+_0x4268a2(0x91)+_0x4268a2(0x9d)+_0x4268a2(0xac))+_0x1be795,{'responseType':_0x1a785f[_0x4268a2(0xa1)]});return{'status':!![],'code':0xc8,'creator':_0x1a785f[_0x4268a2(0x95)],'buffer':_0x102587};}catch(_0x2ba1ac){return console[_0x4268a2(0x92)](_0x2ba1ac),{'status':![],'code':0x1f4,'creator':_0x1a785f[_0x4268a2(0x95)],'message':_0x2ba1ac[_0x4268a2(0x88)]||_0x2ba1ac||_0x1a785f[_0x4268a2(0xa7)]};}}module[_0x36f708(0x93)]={'pollinationsAi':pollinationsAi};function _0xfbe3(){const _0x49728a=['FINJa','get','9939360bvtrSw','FMpkZ','768dapqBB','&seed=','6651185zWwVQO','random','87255wqFneb','SAtVW','An\x20interna','Query\x20not\x20','message','https://im','BeABU','l\x20server\x20i','prompt/','ue&model=f','axios','pDKpA','104316sTxEAH','lux-pro&en','error','exports','age.pollin','IdXbY','?nologo=tr','56620IhwDhs','147XGVMIl','2013DpnGTQ','floor','1wZHYss','arraybuffe','hance=true','@PikaBotz','144ZjGyFP','681002dLfXGy','CxDjI','ssue','found','75693sYnKiH','ations.ai/','wPGcX'];_0xfbe3=function(){return _0x49728a;};return _0xfbe3();}
